## `infra/terraform/prod`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_api_gateway_domain_name.libra: Reading...
data.aws_route53_zone.tomozo6_com: Reading...
aws_dynamodb_table.libra: Refreshing state... [id=libra-beta-dynamodb-table]
data.aws_api_gateway_domain_name.libra: Read complete after 1s [id=www.libra.tomozo6.com]
data.aws_route53_zone.tomozo6_com: Read complete after 1s [id=Z0406418180720KM8VM2D]
aws_route53_record.libra: Refreshing state... [id=Z0406418180720KM8VM2D_beta.libra.tomozo6.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.libra must be replaced
-/+ resource "aws_dynamodb_table" "libra" {
      ~ arn              = "arn:aws:dynamodb:ap-northeast-1:518773205675:table/libra-beta-dynamodb-table" -> (known after apply)
      ~ id               = "libra-beta-dynamodb-table" -> (known after apply)
      ~ name             = "libra-beta-dynamodb-table" -> "libra-prod-dynamodb-table" # forces replacement
      + stream_arn       = (known after apply)
      - stream_enabled   = false -> null
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ point_in_time_recovery {
          ~ enabled = false -> (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      ~ ttl {
          + attribute_name = (known after apply)
          ~ enabled        = false -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.libra must be replaced
-/+ resource "aws_route53_record" "libra" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "beta.libra.tomozo6.com" -> (known after apply)
      ~ id              = "Z0406418180720KM8VM2D_beta.libra.tomozo6.com_A" -> (known after apply)
      ~ name            = "beta.libra.tomozo6.com" -> "www.libra.tomozo6.com" # forces replacement
      - records         = [] -> null
      - ttl             = 0 -> null
        # (2 unchanged attributes hidden)

      + alias {
          + evaluate_target_health = false
          + name                   = "d-3qwt91o0mb.execute-api.ap-northeast-1.amazonaws.com"
          + zone_id                = "Z1YSHQZHG15GKL"
        }
      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d-762cmy1n5a.execute-api.ap-northeast-1.amazonaws.com" -> null
          - zone_id                = "Z1YSHQZHG15GKL" -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @tomozo6, Action: `pull_request`*